# -*- mode: org -*-
#+TITLE: my emacs init file configs but in orgmode
#+SETUPFILE: ~/set-up-files/basic-setups.org
#+LANGUAGE: en
#+OPTIONS: toc:3 timestamp:t
#+DESCRIPTION: My org-mode configs and descriptions (got most of them from Bernt Hansen (http://doc.norang.ca/org-mode.html))
#+KEYWORDS:  org-mode Emacs organization GTD getting-things-done git

#+begin_comment
;; following is another way of generating .el files from .org
;; here used 'org-babel-load-file' instead
;; #+PROPERTY: header-args :tangle ./emacs_init_configs.el
#+end_comment

*** Drop use of old style field references in tables (for spreadsheet operations)
  + Notes ::
    - can do A LOT with emacs tables, even spreadsheet operations as an excel file
    - source :: https://orgmode.org/worg/org-tutorials/org-spreadsheet-intro.html
    - suppose the following table ::
      | One | Two | Three |
      |-----+-----+-------|
      |   1 |   1 |     2 |
      |   3 |   6 |     5 |
      |   3 |   4 |     2 |
    - let's try to get to the following result ::
      | One | Two | Three | Mean           |
      |-----+-----+-------+----------------|
      |   1 |   1 |     2 | [formula]      |
      |   3 |   6 |     5 |                |
      |   3 |   4 |     2 |                |
    - when entering ==C-c ?== in [formula], you get : ==line @2, col $4, ref @2$4 or D2==, which means :: you are on the second row (or line) of the fourth column, and the reference for this field is either ==@2$4== or ==D2==
      + ==D2== is for reference visualization grid (4th column D, 2nd line)
      + when want to be sure, can turn on/off the reference visualization grid with ==C-c }==
    - formulas ::
      + can enter formula in [formula] by typing ==:=vmean($2..$3)== (find mean of fields 2nd to 3rd _in this row_) in field
	- can also use ==:=vmean(B&..C&)==, where the & character stands for "in this row", which is implicit in previous notation
      + hit ==C-c C-c== in row ::
	1. the formula has been replaced by the result of the calculation
	2. a new line starting with ==#+TBLFM== has been inserted at the bottom of the table
      + result ::
	| One     | Two | Three | Mean |
	|---------+-----+-------+------|
	| a thing |   1 |     2 |  1.5 |
	| another |   6 |     5 |      |
	| a third |   4 |     2 |      |
	#+TBLFM: @2$4=vmean($2..$3)
      + ==#+TBLFM== contains all the formulas for the table above
	- be careful while editing it manually
      + to compute same formula for all fields (column formula, instead of field formula) ::
	1. go in same field
	2. type =='=vmean($2..$3)'== ('​=' instead of ':​=')
	3. ==C-c C-c==
	   - prompts to :: whether you want to replace the formula with a column formula (yes)
	4. reapply all formulas with ==C-u C-c *==
	   - or ==C-c C-c== on the #+TBLFM line (which should then be ==#+TBLFM: $4=vmean($2..$3)==, and applied to $4 column)
      + same steps, but on a row formula :: (2 field formulas: each one calculating the mean for the fields above in the same column)
      + final result ::
	| One      |       Two | Three | Mean |
	|----------+-----------+-------+------|
	| a thing  |         1 |     2 |  1.5 |
	| another  |         6 |     5 |  5.5 |
	| a third  |         4 |     2 |    3 |
	| Mean row | 3.6666667 |     3 |      |
	#+TBLFM: $2=vmean(@2$2..@4$2)::$3=vmean(@2$3..@4$3)::$4=vmean($2..$3)
    - interactive formulas ::
      + instead of inserting formulas directly in the table cells ::
	- typing ==​=== in a field :: starts the definition for a column formula
	- typing ==:​=== :: starts a definition for a field formula
      + can also use minibuffer ::
	- ==C-c ​=== :: for editing column formulas
	- ==C-u C-c ​=== :: for field formulas
      + can also edit formulas more interactively in a dedicated buffer using :: ==C-c '==
	- new buffer lists all the formulas for the table at point and provides facilities to edit the references
	- when the cursor is above a reference, the corresponding field in the table gets highlighted
	- can select the reference with ==S-<left/right/up/down>==
    - even more (Calc and Elisp formulas, debugging formulas, etc.) in :: https://orgmode.org/worg/org-tutorials/org-spreadsheet-intro.html
  + bh config ::
    - drop the old A3/B4 style references from tables when editing ::
      #+header: :tangle yes
      #+begin_src emacs-lisp
      (setq org-table-use-standard-references (quote from))
      #+end_src
  + kbds ::
    - ==C-c ?== in table field :: you get : ==line @2, col $4, ref @2$4 or D2==, which means: second row (or line) of fourth column, and the reference for this field is either ==@2$4== or ==D2== (reference visualization grid: 4th column D, 2nd line
    - ==C-c }== :: turn on/off the reference visualization grid
    - formulas ::
      + in field ::
	- ==:=vmean($2..$3)== :: finds mean of fields 2nd to 3rd _in this row_
	- ==:=vmean(B&..C&)== :: same as above, (& character stands for "in this row", implicit in previous notation)
      + =='=vmean($2..$3)'== ('​=' instead of ':​=') :: formula on column
    - ==C-c C-c== in row :: eval formula
    - ==C-u C-c *== :: reapply all formulas
      + or ==C-c C-c== on #+TBLFM line
    - interactive formulas ::
      + ==​=== in a field :: start the definition for a column formula
      + ==:​=== :: starts a definition for a field formula
      + in minibuffer ::
	- ==C-c ​=== :: for editing column formulas
	- ==C-u C-c ​=== :: for field formulas
      + in a dedicated buffer, using :: ==C-c '==
	- new buffer lists all the formulas for the table at point and provides facilities to edit the references
	- when the cursor is above a reference, the corresponding field in the table gets highlighted
	- can select the reference with ==S-<left/right/up/down>==

